const ERROR_MAP = {}
let ERROR = (errnum, errmsg) => {
  return (ERROR_MAP[errnum] = errmsg)
}
ERROR(1000, '亲!你不是成长会员哦~~')
ERROR(1000, '亲!你不是长险客户啦~~')

ERROR(20000, '哎呦喂!小伙伴热情太高,被挤爆了,稍后再试哦!')
ERROR(30051, '获取的用户的称呼信息失败啦~')

// 地址信息
ERROR(20001, '亲，增加或者修改地址失败啦~')
ERROR(20002, '亲，修改后的地址已存在啦~')
ERROR(20003, '亲，地址太多啦~')
ERROR(20004, '亲，存在重复地址~')
ERROR(20005, '亲，加载地址失败啦~')
ERROR(20006, '亲，删除地址失败啦~')
ERROR(20007, '亲，获得默认地址失败啦~')
ERROR(20008, '亲，该地址不存在哦~')
ERROR(20009, '亲，默认地址不要删哦~')
ERROR(20010, '亲，指定默认地址失败啦~')

// 缤纷活动
ERROR(30000, '加载缤纷活动信息失败!')
ERROR(30001, '统计访问量失败!')

// video
ERROR(30002, '名医话健康查询失败!')
ERROR(30003, '获取跳转云频失败!')
ERROR(30004, '进入云频直播平台失败!')

// 礼包
ERROR(30010, '获取礼包信息失败!')
ERROR(30011, '加载观赏礼包信息失败!')
ERROR(30012, '兑换尊享礼包失败!')
ERROR(30013, '重复交付交易请求!')
ERROR(30014, '限兑换次数上限!')
ERROR(30015, '积点值不足!')
ERROR(30016, '库存不足!')
ERROR(30017, '手机号码错误!')
ERROR(30018, '健康服务跳转安联失败!')
ERROR(30019, '获取用户信息失败!')
ERROR(30020, '校验信息失败!')
ERROR(30021, '加载功勋礼包信息失败!')
ERROR(30022, '获取会员成长值信息失败!')
ERROR(30023, '获取获取用户信息失败!')

// 我的订单
ERROR(30024, '加载全部订单信息失败!')
ERROR(30025, '我的订单跳转链接失败!')
ERROR(30026, '获取订单详情总控制的url失败!')
ERROR(30027, '加载历史订单的信息失败!')
ERROR(30028, '在跳转到卡券加载的信息失败!')
ERROR(30029, '加载详细卡券信息失败!')
ERROR(30030, '加载京东绑卡页面失败!')
ERROR(30031, '欢乐抢信息展示失败!')

// 抽奖
ERROR(30032, '调用成长接口0032出错!')
ERROR(30033, '验证客户信息是否是成长会员失败!')
ERROR(30034, '加载用户信息及积分失败!')
ERROR(30035, '抽奖失败!')
ERROR(30036, '查询中奖信息异常!')
ERROR(30037, '加载奖品信息异常!')
ERROR(30038, '定时更新中奖信息异常!')

// 彩虹商城
ERROR(30039, '加载彩虹活动列表失败!')
ERROR(30040, '加载彩虹商城列表失败!')
ERROR(30041, '加载彩虹活动信息和地址信息失败!')
ERROR(30042, '积分兑换商品失败!')
ERROR(30043, '兑换成功后获取的信息失败!')

// 公益活动
ERROR(30044, '加载公益活动列表失败啦~')
ERROR(30045, '加载具体活动时所需要的信息失败啦~')
ERROR(30046, '加载单个公益活动信息失败啦~')
ERROR(30048, '加载公益活动详情信息失败啦~')
ERROR(30049, '加载兑换的列表记录失败啦~')
ERROR(30050, '亲，您捐助失败啦~')
ERROR(30052, '加载成功页面信息失败啦~')

// 俱乐部兑换
ERROR(30061, '亲，网络繁忙，请稍后再试~')// 兑换服务失败
ERROR(30062, '您手指点得太快，我们跟不上啦，请稍后再试哦！')// 重复提交兑换请求
ERROR(30063, '亲，您已兑换过了哦。快到“我的订单”中查看吧')// 超过兑换次数上限
ERROR(30064, '亲，您的积点不够了耶~')// 积点值不足
ERROR(30065, '亲，该兑换项目太火爆，紧急补货中，过几天再来吧~')// 库存不足
ERROR(30066, '电子券码无法发送，请联系洋洋客服。')// 其他原因
ERROR(30067, '亲，网络繁忙，请稍后再试~')// 2分钟内不能重复兑换
ERROR(30068, '兑换服务失败，商品已被从E采列表里移除')
ERROR(30069, '兑换服务失败，商品已被下架')
ERROR(30070, '兑换服务失败，E采库存不足')
ERROR(30071, '兑换服务失败，商品价格错误')
ERROR(30073, '兑换服务失败，地址代号变更')

ERROR(30080, '加载我的徽章出错~')

// 俱乐部周周乐
ERROR(30081, '俱乐部周周乐进入首页前校验失败!')
ERROR(30082, '获取周周乐首页信息失败!')
ERROR('00', '交易成功')
ERROR(12, '兑换完毕')
ERROR(13, '兑换关闭')
ERROR(14, '积分不足')
ERROR(15, '兑换上限')
ERROR(16, '服务处理中')
ERROR(99, '会话失效')
ERROR('01', '兑换失败')
ERROR('02', '领取失败')
ERROR(21, '手机号错误')
ERROR(22, '姓名错误')
ERROR(23, '地址错误')
ERROR(30095, '获取历史开奖记录失败')
ERROR(30096, '获取兑换记录失败')
ERROR(30097, '获取客户信息失败')

ERROR('31001', '亲!你不是成长会员哦~~')
// ERROR("00000", "无法根据此openId找到相关用户。")
// ERROR("00010", "此openId用户没有绑定")

ERROR(33001, '您已经加入过TA的团了！')
ERROR(33002, '手慢了，队伍已满！')
ERROR(33003, '自己不能加入自己的团！')
ERROR(33006, '传入参数与实际参数不符！')
ERROR(33007, '中奖信息保存失败！')
ERROR(33008, '未做健康测评！')
ERROR(33009, '实际中奖人与领奖人不符！')
ERROR(33010, '领奖信息已填写！')
ERROR(33011, '领奖身份证号填写错误！')
ERROR(33012, '两人组团活动未开放')
ERROR(30203, '已经抽过奖！')
ERROR(30204, '活动已结束！')
ERROR = null
export const GET_ERROR = msg => {
  let errorCode = msg.split('=')[0]
  if (!ERROR_MAP[errorCode]) return '加载失败！'
  return ERROR_MAP[errorCode]
}
